Repository: fgrandvarlet/ExandasPostgres
Catalog: ExandasPostgres/Properties/Strings.*.resx
Languages: fr

# About
source: About {0}
fr: À propos de {0}

# AboutMenu
source: &About...
fr: &A propos...

# ActivateAddition
source: Activate the addition of a record
fr: Activer l'ajout d'un enregistrement

source: Add
fr: Ajouter

# ApplicationRestarted
source: The application will be restarted to be taken into account.
fr: L'application va être redémarrée pour prise en compte.

source: &Apply
fr: A&ppliquer

# AreYouSureDelete
source: Are you sure you want to delete the following record :
fr: Êtes-vous sûr de vouloir supprimer l'enregistrement suivant :

source: At least one schema mapping required
fr: Au moins une correspondance de schéma obligatoire

source: &Cancel
fr: &Annuler

# CancelButton
source: Cancel
fr: Annuler

# CannotDelete
source: Cannot delete this record because it occurs in at least one comparison set.
fr: Impossible de supprimer cet enregistrement car il intervient dans au moins un jeu de comparaison.

source: Checking the connection
fr: Vérification de la connexion

# Checks
source: check constraints
fr: contraintes de vérification

source: Close
fr: Fermer

source: Compact
fr: Compacter

source: Compaction completed
fr: Compactage terminé

# CompactLocalDatabase
source: Compact the local database
fr: Compacter la base de données locale

# CompactLocalDatabaseMenu
source: &Compact the local database
fr: &Compacter la base de données locale

source: Comparison report
fr: Rapport de comparaison

source: Comparison set detail
fr: Détail jeu de comparaison

source: Comparison set ID
fr: ID jeu de comparaison

# ComparisonSetList
source: List of comparison sets
fr: Liste des jeux de comparaison

source: Comparison set name
fr: Nom du jeu de comparaison

source: Comparison set name required
fr: Nom du jeu de comparaison obligatoire

source: Comparison sets
fr: Jeux de comparaison

source: Connection failed.
fr: Echec de la connexion.

source: Connection ID
fr: ID connexion

source: Connection name
fr: Nom de la connexion

source: Connection name required
fr: Nom de la connexion obligatoire

# ConnectionsComparisonSets
source: C&onnections and comparison sets
fr: C&onnexions et jeux de comparaison

source: Database
fr: Base de données

source: Database required
fr: Base de données obligatoire

source: Delete
fr: Supprimer

source: Delete record ?
fr: Suppression de l'enregistrement ?

# DeltaOf
source: Delta of {0}
fr: Delta des {0}

source: domains
fr: domaines

# DoYouConfirmGeneration
source: Do you confirm the generation of the comparison report ?
fr: Confirmez-vous la génération du rapport de comparaison ?

source: Entity
fr: Entité

source: ExandasPostgres Error
fr: Erreur ExandasPostgres

# Exclusions
source: exclusion constraints
fr: contraintes d'exclusion

# ExportConnectionsComparisonSets
source: Export connections and comparison sets
fr: Exporter les connexions et jeux de comparaison

# ExportMenu
source: &Export
fr: &Exporter

# ExportPerformed
source: Export performed in the file :
fr: Exportation effectuée dans le fichier :

source: &File
fr: &Fichier

# FileSizeColon
source: File size :
fr: Taille du fichier :

source: Filter settings
fr: Paramètres de filtrage

source: foreign keys
fr: clés étrangères

source: foreign table columns
fr: colonnes de table distante

source: foreign tables
fr: tables distantes

# FormError
source: Form data validation error.
fr: Erreur de validation des données du formulaire.

# ForPostgres
source: for PostgreSQL
fr: pour PostgreSQL

source: functions
fr: fonctions

# GenerateComparisonReport
source: Generate the comparison report
fr: Générer le rapport de comparaison

# GenerationInProgress
source: Comparison report generation in progress...
fr: Génération du rapport de comparaison en cours...

source: &Help
fr: &Aide

source: Host
fr: Hôte

source: Host name
fr: Nom d'hôte

source: Hostname required
fr: Hôte obligatoire

# ImportConnectionsComparisonSets
source: Import connections and comparison sets from a file
fr: Importer des connexions et jeux de comparaison à partir d'un fichier

# ImportMenu
source: &Import
fr: &Importer

# ImportPerformed
source: Import of connections and comparison sets performed.
fr: Importation des connexions et jeux de comparaison effectuée.

source: index columns
fr: colonnes d'index

source: indexes
fr: index

source: Label
fr: Libellé

source: Last comparison report
fr: Dernier rapport de comparaison

source: Last report time
fr: Dernier rapport

# LaunchComparisonReport
source: Launch of the comparison report ?
fr: Lancement du rapport de comparaison ?

# ListSchemaMappings
source: List of schema mappings
fr: Liste des correspondances de schéma

# LoadingObjects
source: Loading {1} {0}
fr: Chargement des {0} {1}

source: Local database
fr: Base de données locale

source: Local database backup
fr: Sauvegarde de la base de données locale

# LocalDatabaseColon
source: Local database :
fr: Base de données locale :

source: &Local database size
fr: &Taille de la base de données locale

source: materialized view columns
fr: colonnes de vue matérialisée

source: materialized views
fr: vues matérialisées

source: Modify
fr: Modifier

source: Name
fr: Nom

# NoButton
source: No
fr: Non

source: <Not specified>
fr: <Non renseigné>

# ObjectInSource
source: Object in source absent in target
fr: Objet dans source absent en cible

# ObjectInTarget
source: Object in target absent in source
fr: Objet dans cible absent en source

source: Object name
fr: Nom d'objet

source: Operation canceled.
fr: Opération annulée.

source: Parent object
fr: Objet parent

source: Password
fr: Mot de passe

source: Password required
fr: Mot de passe obligatoire

# PleaseCheckExcel
source: Please check that the document is not already open in Excel.
fr: Veuillez vérifier que le document n'est pas déjà ouvert dans Excel.

source: Port required
fr: Port obligatoire

source: primary keys
fr: clés primaires

source: Property
fr: Propriété

source: Property difference
fr: Différence de propriété

# PropertyNameRequired
source: Property name required in this context
fr: Nom de propriété obligatoire dans ce contexte

source: Purge comparison reports
fr: Purger les rapports de comparaison

source: Purging comparison reports
fr: Purge des rapports de comparaison

# PurgingMetadata
source: Purging metadata tables
fr: Purge des tables des métadonnées

source: &Quit
fr: &Quitter

source: Refresh
fr: Rafraîchir

# RestoringLocalDatabase
source: Restoring the local database
fr: Restauration de la base de données locale

# SaveTheFilterSettings
source: Save the filter settings applicable to the comparison set here to exclude matching rows in the comparison report.
fr: Enregistrez ici les paramètres de filtrage applicables au jeu de comparaison pour exclure les lignes correspondantes dans le rapport de comparaison.

# SchemaDoesNotExistSource
source: Schema [{0}] does not exist in the source database [{1}]
fr: Le schéma [{0}] n'existe pas dans la base de données source [{1}]

# SchemaDoesNotExistTarget
source: Schema [{0}] does not exist in the target database [{1}]
fr: Le schéma [{0}] n'existe pas dans la base de données cible [{1}]

source: Schema mapping
fr: Correspondance de schéma

source: Schema mapping detail
fr: Détail correspondance de schéma

source: Schema mapping ID
fr: ID correspondance de schéma

source: sequences
fr: séquences

source: Server connection detail
fr: Détail connexion serveur

source: Server connections
fr: Connexions serveur

# ServerConnectionsList
source: List of server connections
fr: Liste des connexions serveur

source: Source connection
fr: Connexion source

source: Source database
fr: Base de données source

source: Source schema
fr: Schéma source

source: Source schema required
fr: Schéma source obligatoire

source: Source server connection
fr: Connexion serveur source

source: Source server connection required
fr: Connexion serveur source obligatoire

source: Source value
fr: Valeur source

# Statistics
source: extended statistics
fr: statistiques étendues

source: Successful connection
fr: Connexion réussie

source: table columns
fr: colonnes de table

source: target
fr: cible

source: Target connection
fr: Connexion cible

source: Target database
fr: Base de données cible

source: Target schema
fr: Schéma cible

source: Target schema required
fr: Schéma cible obligatoire

source: Target server connection
fr: Connexion serveur cible

source: Target server connection required
fr: Connexion serveur cible obligatoire

source: Target value
fr: Valeur cible

source: &Tools
fr: &Outils

source: triggers
fr: déclencheurs

source: TRUNCATED
fr: TRONQUÉ

source: Unable to delete last schema mapping.
fr: Impossible de supprimer la dernière correspondance de schéma.

source: User
fr: Utilisateur

source: User name
fr: Nom utilisateur

source: User name required
fr: Nom utilisateur obligatoire

source: view columns
fr: colonnes de vue

# ViewComparisonReport
source: View the comparison report
fr: Consulter le rapport de comparaison

source: views
fr: vues

source: Warning
fr: Attention

# YesButton
source: Yes
fr: Oui
